'''
class Buffer - класс для работы с буфером обмена информации

Дополнительные сторонние модули для обработки файлов
    clipboard

Реализация методов класса - Макс Романенко (Red Alert) - 2022г.
'''
# *****************************************************************************************
# работы с буфером обмена информации
import clipboard
# *****************************************************************************************
# Buffer - автоматическая локализация программы на родной язык
class Buffer:
    '''
    class Buffer - класс для работы с буфером обмена информации\n
    методы:\n
        copy_info_get(self) -> str\n
        copy_info_set(self, info: str) -> None\n
    '''
    # ---------------------------------------------------------------------------
    # Возвращает из буфера обмена информации последнюю скопированную информацию
    def copy_info_get(self) -> str:
        '''
        Eng:\n
        Returns the last copied information from the clipboard.\n
        Rus:\n
        Возвращает из буфера обмена информации последнюю скопированную информацию.\n
        '''
        try:
            return clipboard.paste()
        except (Exception) as e:
            return str(e)
    # ---------------------------------------------------------------------------
    # Копирует информацию в буфер обмена
    def copy_info_set(self, info: str) -> None:
        '''
        Eng:\n
        Copies the information to the clipboard.\n
        :param info: information to be pasted to the clipboard.\n
        Rus:\n
        Копирует информацию в буфер обмена.\n
        :параметр info: информация которую нужно вставить в буфер обмена.\n
        '''
        try:
            clipboard.copy(info)
        except (Exception) as e:
            return str(e)
    # ---------------------------------------------------------------------------
    # Блокирует буфер обмена (запрет копирования)
    def lock(self) -> None:
        '''
        Eng:\n
        Blocks the clipboard (prohibits copying).\n
        Rus:\n
        Блокирует буфер обмена (запрет копирования).\n
        '''
        try:
            pass
        except (Exception) as e:
            return str(e)
    # ---------------------------------------------------------------------------
# *****************************************************************************************
# тесты
# если не модуль то выполнить программу
if __name__ == '__main__':
    print('-------------------------------------')
    print('+++++clipboard test+++++')
    # показывает последнюю информацию из буффера обмена
    print(f'{clipboard.paste()}')
    # вставляет информацию в буффера обмена
    clipboard.copy('RED ALERT')
    # показывает последнюю информацию из буффера обмена
    print(f'{clipboard.paste()}')
    print('-------------------------------------')
    print('+++++copy_info_get+++++')
    print(Buffer().copy_info_get())
    print('-------------------------------------')
    print('+++++copy_info_set+++++')
    Buffer().copy_info_set('Max Ramanenka')
    print(Buffer().copy_info_get())
# *****************************************************************************************