'''
class DateTime - класс для работы с датой и временем устройства

Дополнительные сторонние модули для обработки файлов
    нет

Реализация методов класса - Макс Романенко (Red Alert) - 2022г.
'''
# *****************************************************************************************
# module

# *****************************************************************************************
# DateTime - класс для работы с датой и временем устройства
class DateTime:
    '''
    class DateTime - класс для работы с датой и временем устройства\n
    методы:\n
        None
    '''
    # ---------------------------------------------------------------------------
    # vars
    pass
    # ---------------------------------------------------------------------------
    # Показать текущуюю дату взятую из интернета
    def date_current_show_from_net(self) -> str:
        '''
        Eng:\n
        Show the current date taken from the internet.\n
        Rus:\n
        Показать текущую дату взятую из интернета.\n
        '''
        try:
            pass
        except (Exception) as e:
            return str(e)
    # ---------------------------------------------------------------------------
# *****************************************************************************************
# тесты
# если не модуль то выполнить программу
if __name__ == '__main__':
    print('-------------------------------------')
    print('+++++method+++++')
    # method
    pass
# *****************************************************************************************