'''
class Keyboard - класс для работы с клавиатурай устройства

Дополнительные сторонние модули для обработки файлов
    нет

Реализация методов класса - Макс Романенко (Red Alert) - 2022г.
'''
# *****************************************************************************************
# module
# Управление клавиатурой
from pynput.keyboard import Key, Controller
# Мониторинг клавиатуры
from pynput import keyboard
# *****************************************************************************************
# Keyboard - класс для работы с клавиатурай устройства
class Keyboard:
    '''
    class Keyboard - класс для работы с клавиатурай устройства\n
    методы:\n
        None\n
    '''
    # ---------------------------------------------------------------------------
    # vars
    pass
    # ---------------------------------------------------------------------------
    # Показать кнопку которая была нажата
    def button_press_show(self) -> str:
        '''
        Eng:\n
        Show the button that was pressed.\n
        Rus:\n
        Показать кнопку которая была нажата.\n
        '''
        try:
            # блок `with` слушает события до выхода 
            # до остановки слушателя
            with keyboard.Listener(
                    on_press=on_press,
                    on_release=on_release) as listener:
                listener.join()
        except (Exception) as e:
            return str(e)
    # ---------------------------------------------------------------------------
    # Блокировка кнопки PrtSc
    def prt_sc_lock(self) -> None:
        '''
        Eng:\n
        PrtSc button Lock.\n
        Rus:\n
        Блокировка кнопки PrtSc.\n
        '''
        try:
            pass
        except (Exception) as e:
            return str(e)
    # ---------------------------------------------------------------------------
    # Снятие с блокировки кнопки PrtSc
    def prt_sc_unlock(self) -> None:
        '''
        Eng:\n
        Unlocking the PrtSc button.\n
        Rus:\n
        Снятие с блокировки кнопки PrtSc.\n
        '''
        try:
            pass
        except (Exception) as e:
            return str(e)
    # ---------------------------------------------------------------------------
# *****************************************************************************************
# тесты
# если не модуль то выполнить программу
if __name__ == '__main__':
    print('-------------------------------------')
    print('+++++method+++++')
    # method
    pass
# *****************************************************************************************