'''
class Keyboard - класс для работы с клавиатурай устройства

Дополнительные сторонние модули для обработки файлов
    нет

Реализация методов класса - Макс Романенко (Red Alert) - 2022г.
'''
# *****************************************************************************************
# module
pass
# *****************************************************************************************
# Keyboard - класс для работы с клавиатурай устройства
class Keyboard:
    '''
    class Keyboard - класс для работы с клавиатурай устройства\n
    методы:\n
        None\n
    '''
    # ---------------------------------------------------------------------------
    # vars
    pass
    # ---------------------------------------------------------------------------
    # Блокировка кнопки PrtSc
    def prt_sc_lock(self) -> None:
        '''
        Eng:\n
        PrtSc button Lock.\n
        Rus:\n
        Блокировка кнопки PrtSc.\n
        '''
        try:
            pass
        except (Exception) as e:
            return str(e)
    # ---------------------------------------------------------------------------
    # Снятие с блокировки кнопки PrtSc
    def prt_sc_unlock(self) -> None:
        '''
        Eng:\n
        Unlocking the PrtSc button.\n
        Rus:\n
        Снятие с блокировки кнопки PrtSc.\n
        '''
        try:
            pass
        except (Exception) as e:
            return str(e)
    # ---------------------------------------------------------------------------
# *****************************************************************************************
# тесты
# если не модуль то выполнить программу
if __name__ == '__main__':
    print('-------------------------------------')
    print('+++++method+++++')
    # method
    pass
# *****************************************************************************************