'''
Болотная сортировка (Bogosort) — неэффективный алгоритм сортировки, 
используемый только в образовательных целях и противопоставляемый другим, 
более реалистичным алгоритмам.

Принцип работы алгоритма прост, как плесень. 
Перетряхиваем список случайным образом до тех пор пока 
он внезапно не отсортируется. Процесс может счастливо 
завершиться сразу, а может длиться до тепловой 
смерти Вселенной. Это уж как повезёт.

Колода в 32 карты будет сортироваться компьютером в среднем 2,7 * 10^19 лет.

Реализация алгоритма - Максим Романенко (Red Alert) - 2022г.
'''
# *****************************************************************************************

# *****************************************************************************************