'''
MAC-адрес — уникальный идентификатор, присваиваемый каждой единице активного 
оборудования или некоторым их интерфейсам в компьютерных сетях Ethernet.

Алгоритм получения MAC адреса устройства
    импортируем модуль UUID (uuid – универсальные уникальные идентификаторы)
    применяем метод getnode() - извлечение MAC-адреса (устройства)
    форматируем в читабельный вид

Реализация алгоритма - Максим Романенко (Red Alert) - 2022г.
'''
# *****************************************************************************************
# импорт модуля UUID (uuid – универсальные уникальные идентификаторы)
# getnode() - извлечение MAC-адреса компьютера (устройства)
from uuid import getnode
# *****************************************************************************************
# класс - работа с MAC адресом устройства
class MacAddress:
    '''
    ************************************************************
    * class MacAddress - работа с MAC адресом устройства       *
    *----------------------------------------------------------*
    * методы:                                                  *
    *----------------------------------------------------------*
    * mac_address_get() -> str                                 *
    *           возвращает MAC адрес устройсва                 *
    *           возвращаемое значение - str (текстовая строка) *
    ************************************************************
    '''
    # ---------------------------------------------------------------------------
    # метод - получает и возвращает MAC адресс устройства
    def mac_address_get(self) -> str:
        '''
        ************************************************************
        * mac_address_get() -> str                                 *
        *           возвращает MAC адрес устройсва                 *
        *           возвращаемое значение - str (текстовая строка) *
        ************************************************************
        '''
        return ':'.join(['{:02x}'.format((getnode() >> ele) & 0xff)\
             for ele in range(0, 8*6, 8)][::-1])
    # ---------------------------------------------------------------------------
# *****************************************************************************************
# тест
# если не модуль, то выполнить
if __name__ == '__main__':
    # получаем MAC адрес
    mac_address = MacAddress().mac_address_get()
    # вывод в консоль MAC адреса
    print('MAC address:',mac_address)
    # вывод дукументации класса
    print(MacAddress.__doc__)
    # вывод дукументации метода
    print(MacAddress().mac_address_get.__doc__)
# *****************************************************************************************